# 16, 8 진수 표기법
a = 0xA28
b = 0o10

print(a+b)  # 2608

# _는 생략됨
c = 1_000_000
print(c)  # 1000000

# '', "" 사용법
print("안녕하세요 '지훈'입니다.")
print('안녕하세요 \'지훈\'입니다.')

print("백슬래시\\")  # 백슬래시\
print("작은 따음표 \' 를 출력")  # 작은 따음표 '를 출력

# 문자열 포맷팅
print("이름: %s \n나이: %d 세" % ("최지훈", 26))  # 튜플을 사용
print("이름: %(name)s \n나이: %(age)d 세" %
      {"name": "최지훈", "age": 26})  # 자료구조 사전 사용
print("%s %c %d %o %x %f %%" % (97, 97, 97, 97, 97, 97))
print("%10s" % "우측정렬")  # _ _ _ _ _ _ 우측정렬
print("%-10s" % "좌측정렬")  # 좌측정렬 _ _ _ _ _ _
print("%10.2f" % 3.141592)  # _ _ _ _ _ _ 3.14
print("%010.2f" % 3.141592)  # 0000003.14

# str.format()
print("이름: {}, 나이: {}".format("최지훈", 26))
print("이름: {1}, 나이: {0}".format("최지훈", 26))
print("이름: {1:c}, 나이: {0}".format("최지훈", 97))
print("이름: {name}, 나이: {age}".format(name="최지훈", age=26))
print("{1:<10} \n {0:>10} \n {2:^10} \n {3:*^10}".format("우측정렬",
      "좌측정렬", "중앙정렬", "중앙과 별"))
